benchmark.redis.txt
====== PING_INLINE ======
  1000 requests completed in 0.04 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

99.10% <= 1 milliseconds
100.00% <= 1 milliseconds
27777.78 requests per second

====== PING_BULK ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
52631.58 requests per second

====== SET ======
  1000 requests completed in 0.03 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
34482.76 requests per second

====== GET ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
52631.58 requests per second

====== INCR ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
50000.00 requests per second

====== LPUSH ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
50000.00 requests per second

====== LPOP ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
52631.58 requests per second

====== SADD ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
50000.00 requests per second

====== SPOP ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
58823.53 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1000 requests completed in 0.02 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
50000.00 requests per second

====== LRANGE_100 (first 100 elements) ======
  1000 requests completed in 0.05 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
18181.82 requests per second

====== LRANGE_300 (first 300 elements) ======
  1000 requests completed in 0.13 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

96.00% <= 1 milliseconds
100.00% <= 1 milliseconds
7751.94 requests per second

====== LRANGE_500 (first 450 elements) ======
  1000 requests completed in 0.19 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

79.70% <= 1 milliseconds
99.40% <= 2 milliseconds
99.60% <= 3 milliseconds
99.70% <= 4 milliseconds
100.00% <= 4 milliseconds
5319.15 requests per second

====== LRANGE_600 (first 600 elements) ======
  1000 requests completed in 0.23 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

34.40% <= 1 milliseconds
93.10% <= 2 milliseconds
100.00% <= 2 milliseconds
4329.00 requests per second

====== MSET (10 keys) ======
  1000 requests completed in 0.04 seconds
  10 parallel clients
  3 bytes payload
  keep alive: 1

100.00% <= 0 milliseconds
27027.03 requests per second